In [12]:
import pandas as pd
data = pd.read_csv('C:\\Users\\todosuk\\Desktop\\titanic.csv', sep =';')

In [16]:
data.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,"211,3375",B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,"0,9167",1,2,113781,"151,55",C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,"151,55",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,"151,55",C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,"151,55",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,"26,55",E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,"77,9583",D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,"51,4792",C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,"49,5042",NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [34]:
sample = data[['pclass','fare','age', 'sex']]# Создаем новый датафрайм с нужными столбцами
sample = sample.replace(to_replace=['male', 'female'], value=[0, 1])# Заменяем male на 0, female на 1
print ('Male = 0, female = 1')
sample = sample.dropna()# Удаляем объекты содержащие NaN
sample

Male = 0, female = 1

      pclass      fare     age  sex
0          1  211,3375      29    1
1          1    151,55  0,9167    0
2          1    151,55       2    1
3          1    151,55      30    0
4          1    151,55      25    1
5          1     26,55      48    0
6          1   77,9583      63    1
7          1         0      39    0
8          1   51,4792      53    1
9          1   49,5042      71    0
10         1   227,525      47    0
11         1   227,525      18    1
12         1      69,3      24    1
13         1     78,85      26    1
14         1        30      80    0
16         1  247,5208      24    0
17         1  247,5208      50    1
18         1   76,2917      32    1
19         1   75,2417      36    0
20         1   52,5542      37    0
21         1   52,5542      47    1
22         1        30      26    0
23         1   227,525      42    1
24         1  221,7792      29    1
25         1        26      25    0
26         1   91,0792      25    0
27         1   91,0792      19    1
28         1  135,6333      35    1
29         1     26,55      28    0
30         1      35,5      45    0
...      ...       ...     ...  ...
1269       3       9,5      33    0
1270       3       9,5      28    0
1271       3       9,5      28    0
1272       3         9      47    0
1273       3        18      18    1
1274       3        18      31    0
1275       3        18      16    0
1276       3        18      31    1
1277       3     7,225      22    0
1278       3    7,8542      20    0
1279       3    7,8542      14    1
1280       3    7,8958      22    0
1281       3         9      22    0
1285       3       9,5    32,5    0
1286       3    7,2292      38    1
1287       3      7,75      51    0
1288       3    6,4958      18    0
1289       3    6,4958      21    0
1290       3         7      47    1
1294       3      16,1    28,5    0
1295       3      7,25      21    0
1296       3    8,6625      27    0
1298       3       9,5      36    0
1299       3   14,4542      27    0
1300       3   14,4542      15    1
1301       3     7,225    45,5    0
1304       3   14,4542    14,5    1
1306       3     7,225    26,5    0
1307       3     7,225      27    0
1308       3     7,875      29    0

[1045 rows x 4 columns]